using Telegram.Bot;
using Telegram.Bot.Types;

namespace QueueManagerBot
{
    public class InfoCommand : ICommand
    {
        public string Name { get; }
        public TelegramBotClient Bot { get; }
        public UserState[] AllowedStates { get; }
        public StateManager StateManager { get; }

        public InfoCommand(string name, TelegramBotClient tgBot, StateManager stateManager)
        {
            Name = name;
            Bot = tgBot;
            StateManager = stateManager;
            AllowedStates = new UserState[]
            {
                UserState.None,
            };
        }

        public bool CanExecute(Message msg, UserState state)
        {
            return msg.Text == Name && AllowedStates.Contains(state);
        }

        public async Task Execute(Message msg)
        {
            await Bot.SendMessage(msg.Chat, 
                @"🗂️ Этот бот помогает организовать очереди на ФИИТе: на консультации, сдачу работ и так далее.

✨ Основные возможности:

✅ Создавай очередь — любой пользователь может завести новую очередь, указав категорию и время открытия записи
✅ Записывайся за секунду — просто выбери очередь и нажми «в начало» или «в конец»
✅ Следи за своим местом — всегда видно, кто перед тобой и сколько человек впереди 👀

Как это работает:

1️⃣ Ты создаёшь очередь (например, «Сдача практики по Python»)
2️⃣ Другие участники записываются через бота в начало или в конец 🔄
3️⃣ Бот показывает актуальный список 📋

Зачем это нужно?
Чтобы в рабочих и учебных чатах был порядок, а запись была быстрой и справедливой для всех! 🎯

🚀 QueueManagerBot — простая и удобная организация очередей");
        }
    }
}